tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "monzo/tap", "git@github.com:monzo/tap.git"
tap "railwaycat/emacsmacport"
brew "aspell"
brew "automake"
brew "python"
brew "awscli"
brew "bash"
brew "bat"
brew "ghc"
brew "cabal-install"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "csshx"
brew "diff-so-fancy"
brew "erlang"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "git"
brew "git-lfs"
brew "glances"
brew "pinentry"
brew "gnupg", link: false
brew "go"
brew "grc"
brew "haskell-stack"
brew "highlight"
brew "htop"
brew "hub"
brew "idris"
brew "jq"
brew "kubernetes-helm"
brew "moreutils"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "pass"
brew "pinentry-mac"
brew "protobuf"
brew "pv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "qemu"
brew "ranger"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby"
brew "rustup-init"
brew "shellcheck"
brew "stow"
brew "syncthing"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash-cli"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "wireshark", link: false
brew "yarn"
brew "ydiff"
brew "ykman"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus", args: ["HEAD"]
brew "monzo/tap/aws-profile"
brew "monzo/tap/kubectl@1.8"
cask "1password"
cask "firefox"
cask "font-inconsolata"
cask "font-source-code-pro"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "karabiner-elements"
cask "logitech-options"
cask "meld"
cask "rocket"
cask "slate"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "wireshark"
cask "yubico-yubikey-manager"
cask "railwaycat/emacsmacport/emacs-mac"
