tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "aspell"
brew "automake"
brew "bash"
brew "bat"
brew "glib"
brew "python@3.9"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "docker", link: false
brew "unbound"
brew "gnutls"
brew "emacs", link: false
brew "entr"
brew "erlang"
brew "exa"
brew "exiftool"
brew "fd"
brew "harfbuzz"
brew "python@3.10"
brew "gobject-introspection"
brew "libass"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "glances"
brew "gnu-sed"
brew "gnupg", link: false
brew "pango"
brew "qt@5"
brew "gnuplot"
brew "librsvg"
brew "graphviz"
brew "highlight"
brew "htop"
brew "hub"
brew "libheif"
brew "imagemagick"
brew "ipython"
brew "jq", args: ["HEAD"]
brew "libslirp"
brew "libssh"
brew "mitmproxy"
brew "moreutils"
brew "mosh"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "qrencode"
brew "pass"
brew "pinentry-mac"
brew "pipenv"
brew "pv"
brew "qemu"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "stow"
brew "syncthing"
brew "telnet"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmux-xpanes"
brew "trash-cli"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "youtube-dl"
brew "zsh"
cask "docker"
cask "emacs"
cask "font-inconsolata"
cask "font-source-code-pro"
cask "google-chrome"
cask "gpg-suite"
cask "karabiner-elements"
cask "logitech-options"
cask "obsidian"
cask "plex-media-server"
cask "prolific-pl2303"
cask "signal"
cask "slate"
cask "spotify"
cask "topnotch"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "zsa-wally"
