tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "christopherthielen/tag-ag"
tap "noahgorstein/tap"

brew "aspell"
brew "automake"
brew "bash"
brew "bat"
brew "buf"
brew "glib"
brew "cmake"
brew "coreutils"
brew "d2"
brew "diff-so-fancy"
brew "diffutils"
brew "docker", link: false
brew "dog"
brew "dos2unix"
brew "entr"
brew "exa"
brew "exiftool"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "python@3.11"
brew "glances"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "gnupg", link: false
brew "harfbuzz"
brew "pango"
brew "gnuplot"
brew "go"
brew "gobject-introspection"
brew "librsvg"
brew "graphviz"
brew "highlight"
brew "htop"
brew "hub"
brew "libheif"
brew "python@3.9"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "libarchive"
brew "libass"
brew "libssh"
brew "mitmproxy"
brew "moreutils"
brew "mosh"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "php"
brew "pinentry-mac"
brew "pipenv"
brew "pv"
brew "python@3.10"
brew "qrencode"
brew "qt@5"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "stow"
brew "telnet"
brew "terraform"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash-cli"
brew "typescript"
brew "wget"
brew "wireguard-tools"
brew "youtube-dl"
brew "zsh"
brew "noahgorstein/tap/jqp"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "docker"
cask "font-inconsolata"
cask "font-source-code-pro"
cask "google-chrome"
cask "gpg-suite"
cask "karabiner-elements"
cask "logitech-options"
cask "mullvadvpn"
cask "obsidian"
cask "plex-media-server"
cask "pomotroid"
cask "prolific-pl2303"
cask "signal"
cask "slack"
cask "slate"
cask "topnotch"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
cask "zulip"
