acpi
acpid
adobe-source-code-pro-fonts
adobe-source-sans-pro-fonts
alsa-utils
aspell
aspell-en
autoconf
automake
baobab
bash
bc
bison
bluez-utils
bzip2
cdiff
cgdb
chicken
clang
clojure
cmake
coreutils
cpupower
cryptsetup
ctags
dconf-editor
devhelp
device-mapper
dhcpcd
dialog
diff-so-fancy
diffutils
dmenu
docker
e2fsprogs
elfutils
elixir
emacs
enchant
eog
erlang
evince
evtest
extundelete
fakeroot
fd-rs
ffmpegthumbnailer
file
file-roller
filesystem
findutils
firefox-beta-bin
flake8
gawk
gcc-multilib
gdm
gettext
git
glade
glances
glibc
global
gnome-backgrounds
gnome-bluetooth
gnome-calculator
gnome-common
gnome-contacts
gnome-control-center
gnome-dictionary
gnome-disk-utility
gnome-font-viewer
gnome-power-manager
gnome-screenshot
gnome-session
gnome-settings-daemon
gnome-shell
gnome-system-monitor
gnome-terminal
gnome-themes-standard
gnome-tweak-tool
gnome-user-docs
gnome-user-share
google-chrome
gparted
grep
grilo-plugins
grub
gst-libav
gtk-xfce-engine
gucharmap
gvfs
gvfs-afc
gvfs-goa
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-smb
gzip
hexchat
highlight
htop
hunspell-en
i3lock
imwheel
inetutils
inotify-tools
intel-ucode
intellij-idea-community-edition
iproute2
iputils
iw
jfsutils
jq
ledger
less
lib32-glibc
licenses
linux
lld
lldb
llvm
logrotate
lvm2
lxrandr
m4
macchanger
make
man-db
man-pages
mdadm
mercurial
mlocate
mousetweaks
mplayer
mtr
mutter
namcap
nasm
nautilus
nautilus-image-converter
neovim
network-manager-applet
networkmanager
noto-fonts
package-query
pacman
pamixer
pass
patch
pavucontrol
pciutils
pcmciautils
perl
pkg-config
pkgstats
popcorntime-ce
poppler
postgresql
powertop
procps-ng
psmisc
pv
python-dbus
python-pip
python-virtualenvwrapper
qpdf
qrencode
qt4
racket-docs
racket-minimal
ranger
reiserfsprogs
rfkill
rsync
ruby
rustup
s-nail
scrot
seahorse
sed
shadow
sshfs
stalonetray
stow
strace
sudo
sushi
sysfsutils
systemd-sysvcompat
tar
tcl
telegram-desktop-bin
texinfo
texlive-core
texlive-latexextra
the_silver_searcher
tig
tk
tmux
totem
tracker
transmission-gtk
trash-cli
trayer
ttf-droid
ttf-inconsolata
ttf-liberation
ttf-roboto
tumbler
unzip
usbutils
util-linux
valgrind
vino
vlc
wget
which
wpa_actiond
wpa_supplicant
x264
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xf86-video-intel
xf86-video-vesa
xfconf
xfsprogs
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontdir
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xdmx
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-server-xwayland
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xsel
yajl
yaourt
yarn
yelp
youtube-dl
yubikey-personalization-gui
zsh
