tap "christopherthielen/tag-ag"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "aspell"
brew "bat"
brew "glib"
brew "coreutils"
brew "dbus"
brew "diff-so-fancy"
brew "direnv"
brew "dog"
brew "entr"
brew "exa"
brew "exiftool"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "python@3.11"
brew "glances"
brew "gnu-sed"
brew "harfbuzz"
brew "gnuplot"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "librsvg"
brew "graphviz"
brew "highlight"
brew "htop"
brew "ipython"
brew "jq"
brew "libarchive"
brew "mosh"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "node"
brew "php"
brew "pinentry-mac"
brew "pipenv"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "sponge"
brew "stow"
brew "telnet"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "trash-cli"
brew "typescript"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "z"
brew "zsh"
brew "christopherthielen/tag-ag/tag-ag"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "chromium"
cask "font-inconsolata"
cask "font-source-code-pro"
cask "gpg-suite"
cask "logitech-options"
cask "meetingbar"
cask "obsidian"
cask "pomotroid"
cask "signal"
cask "topnotch"
cask "visual-studio-code"
cask "whatsapp"
cask "wireshark"
