tap "christopherthielen/tag-ag"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "noahgorstein/tap"

brew "aspell"
brew "bat"
brew "cfn-lint"
brew "coreutils"
brew "d2"
brew "dbus"
brew "diff-so-fancy"
brew "direnv"
brew "dog"
brew "entr"
brew "exiftool"
brew "eza"
brew "fd"
brew "findutils"
brew "fpp"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "glances"
brew "gnu-sed"
brew "go"
brew "highlight"
brew "htop"
brew "ipython"
brew "jq"
brew "libarchive"
brew "mdbook"
brew "mosh"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "node"
brew "pandoc"
brew "pipenv"
brew "pipx"
brew "pkg-config"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "sponge"
brew "stow"
brew "telnet"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "trash-cli"
brew "watch"
brew "wget"
brew "yq"
brew "z"
brew "zsh"
brew "christopherthielen/tag-ag/tag-ag"
brew "noahgorstein/tap/jqp"

cask "1password"
cask "1password-cli"
cask "arc"
cask "chromium"
cask "docker"
cask "font-inconsolata"
cask "font-monaspace-nerd-font"
cask "font-source-code-pro"
cask "meetingbar"
cask "obsidian"
cask "ollama"
cask "signal"
cask "topnotch"
cask "visual-studio-code"
cask "whatsapp"
cask "wireshark"
